src/cf/InformationRegisters/РезультатыВыполненияУсловийСхемПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияУсловийСхемПроцессов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РезультатыВыполненияУсловийСхемПроцессов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать результат условия.
// 
// Параметры:
//  ИмяЭлемента  - Строка
//  Процесс - БизнесПроцессСсылка.КомплексныйПроцесс
//  РезультатУсловия - Булево
Процедура ЗаписатьРезультатУсловия(ИмяЭлемента, Процесс, РезультатУсловия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.РезультатыВыполненияУсловийСхемПроцессов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Процесс = Процесс;
	МенеджерЗаписи.ИмяЭлемента = ИмяЭлемента;
	МенеджерЗаписи.Результат = РезультатУсловия;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	
	МенеджерЗаписи.Записать();
	
	РаботаСПроцессамиПоОбработкамОбъектовСобытия.ПриЗаписиРезультатаУсловия(ИмяЭлемента, Процесс, РезультатУсловия);

КонецПроцедуры

// Прочитать результаты условий.
// 
// Параметры:
//  Процесс - БизнесПроцессСсылка.КомплексныйПроцесс
//  
//  Возвращаемое значение:
//  Массив Из Структура
//     * ИмяЭлемента - Строка
//     * Результат - Булево
//     * Процесс - БизнесПроцессССылка.КомплексныйПроцесс
//
Функция РезультатыВыполненияУсловий(Процесс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаСреза = ТекущаяДатаСеанса();
	Отбор = Новый Структура("Процесс", Процесс);
	
	Таблица = РегистрыСведений.РезультатыВыполненияУсловийСхемПроцессов.СрезПоследних(
		ДатаСреза, Отбор);
		
	РезультатыУсловий = Новый Массив;
	
	Для Каждого Стр Из Таблица Цикл
		
		ЗначениеСтруктура = Новый Структура("Процесс, ИмяЭлемента, Результат");
		ЗаполнитьЗначенияСвойств(ЗначениеСтруктура, Стр);
		
		РезультатыУсловий.Добавить(ЗначениеСтруктура);
		
	КонецЦикла;	 
	
	Возврат РезультатыУсловий;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
